docs/org/client.org
#+TITLE: Client Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: client
#+HUGO_TYPE: docs
#+HUGO_PAIRED_SHORTCODES: tip 

** Install 
   :PROPERTIES:
   :EXPORT_FILE_NAME: install
   :EXPORT_HUGO_WEIGHT: 110
   :END:

To install, you can either grab the pre-built zip file or build the client yourself.

*** Release

Install simply by grabbing the zipped distribution from the [[https://github.com/workflowfm/workflowfm-composer/releases/latest][latest release]] and unzip to your chosen location.

*** Manual build

The client can be built manually using [[https://gradle.org/][Gradle]], which ships with the repository.

You can use either:
  - Pre-installed Gradle: ~gradle~
  - Linux: ~./gradlew~
  - Windows: ~gradlew.bat~

#+BEGIN_tip 
Building requires *JDK 11* or above.
#+END_tip

The client can be compiled and packaged with a single command:
#+BEGIN_SRC sh
  gradle :client:distZip
#+END_SRC

This will create the file ~client/build/distributions/WorkflowFM_Composer-{VERSION}.zip~. 

Unzip it to your favourite location to obtained a client installation.



